#include <stdio.h>
#include <conio.h>
det(int a [3] [3]) //Функция нахождения определителя матрицы
{ int x;
x=a[0] [0] * a [1] [1] * a [2] [2] + a [2] [0] * a [0] [1] * a [1] [2] + a [1] [0] * a [2] [1] * a [0] [2] - a [2] [0] * a [1] [1] * a [0] [2] - a [0] [0] * a [2] [1] * a [1] [2] - a [1] [0] * a [0] [1] * a [2] [2];
return x;
}
main ()
{   int mas [3] [3], i, j, z;  //Описание матрицы
    for ( i=0; i<3; i++) //Ввод матрицы
    for ( j=0; j<3; j++)
    {
      printf ("\n Введите элемент mas [%d] [%d]=", i, j);
      scanf ("%d", &mas [i] [j]);
    }
    printf ("\n Вывод матрицы:\n");
    for (i=0; i<3; i++) //Вывод матрицы по строкам
    {
      for (j=0; j<3; j++)
      printf ("%4d", mas[i] [j] );
      printf ("\n");
    }
z=det (mas); //Вызов функции нахождения определителя и запись результата в переменную
printf ("\n Определитель матрицы=%d", z); //Вывод определителя матрицы
getch();
}
